## Parth Vitekar (75)

In [1]:
import pandas as pd

In [2]:
Details = {
 'Name': ['Parth', 'Piyush', 'Atharva', 'Raj', 'Harsh'],
 'Age': [21, 19, 20, 20, 20],
 'Height': [1.83, 1.65, 1.72, 1.70, 1.62],
 'Gender': ['Male', None, 'Male', 'Male', 'Male'],
 'Address': ['Hadapsar', 'Amanora', 'Somwar Peth', 'Somwar Peth', 'Sihagad']
}

In [3]:
print(Details)

{'Name': ['Parth', 'Piyush', 'Atharva', 'Raj', 'Harsh'], 'Age': [21, 19, 20, 20, 20], 'Height': [1.83, 1.65, 1.72, 1.7, 1.62], 'Gender': ['Male', None, 'Male', 'Male', 'Male'], 'Address': ['Hadapsar', 'Amanora', 'Somwar Peth', 'Somwar Peth', 'Sihagad']}

In [5]:
df = pd.DataFrame(Details)

In [6]:
df

      Name  Age  Height Gender      Address
0    Parth   21    1.83   Male     Hadapsar
1   Piyush   19    1.65   None      Amanora
2  Atharva   20    1.72   Male  Somwar Peth
3      Raj   20    1.70   Male  Somwar Peth
4    Harsh   20    1.62   Male      Sihagad

In [7]:
df.shape

(5, 5)

In [8]:
df.isnull()

    Name    Age  Height  Gender  Address
0  False  False   False   False    False
1  False  False   False    True    False
2  False  False   False   False    False
3  False  False   False   False    False
4  False  False   False   False    False

In [9]:
df.isnull().sum()

Name       0
Age        0
Height     0
Gender     1
Address    0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Height   5 non-null      float64
 3   Gender   4 non-null      object
 4   Address  5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [11]:
df.describe()

             Age    Height
count   5.000000  5.000000
mean   20.000000  1.704000
std     0.707107  0.080808
min    19.000000  1.620000
25%    20.000000  1.650000
50%    20.000000  1.700000
75%    20.000000  1.720000
max    21.000000  1.830000